Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དག་ལ་བརྟེན་ན་ཕུན་སུམ་ཚོགས་པ་ཐམས་ཅད་མངོན་པར་འགྲུབ་པར་འགྱུར་བས།
en: ‘Everything that is excellent can be accomplished on the basis of the thus-gone ones’ ten powers.

source: དེ་དག་ཁོང་དུ་ཆུད་པར་བྱ་བའི་དོན་དུ་ལུས་དང་། པགས་པ་དང་། རྒྱུས་པ་དང་། རུས་པ་སྐམས་ཤིང་ཁོག་པ་དང་། ཤ་དང་ཁྲག་ཡོངས་སུ་སྐམས་ཀྱང་བརྩོན་འགྲུས་བརྩམ་པར་བྱའོ། །
en: Thus, in order to realize them, you should be diligent even at the risk of harming your body, skin, organs, bones, stomach, flesh, and blood.

source: གལ་ཏེ་བརྩོན་འགྲུས་བཏང་ན་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དག་མི་ཐོབ་པར་འགྱུར་རོ། །
en: If you forsake diligence, you will not achieve the thus-gone ones’ ten powers.’

source: དེ་དག་ཐམས་ཅད་བརྩོན་འགྲུས་བརྩམས་པ་དེ་དང་ལྡན་པས། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ཐོབ་པར་བྱ་བའི་ཕྱིར་འབད་དོ། །
en: “All of them then applied diligence and exerted themselves toward achieving the thus-gone ones’ ten powers.

source: དེ་བཞིན་གཤེགས་པ་ཐོགས་པ་མེད་པའི་སྤྱན་དེ་ནི་དེ་དག་ཐམས་ཅད་ཀྱི་སྔོན་དུ་གཤེགས་པར་གྱུར་ཏེ།
en: Thus-Gone One Unhindered Vision led the way for all of them.

source: དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་དཔག་ཏུ་མེད་པ་དེ་དག་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ལ་བཙུད་དེ།
en: The Thus-Gone One was able to bring all those countless sentient beings to the wisdom of buddhahood.

source: དེ་དག་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་འཚང་རྒྱ་ཞིང་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་བཀོད་དོ། །
en: He led them all to awaken to unexcelled and perfect buddhahood and total nirvāṇa.

source: དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་དགེ་བའི་མིག་ཅེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན། དེ་ལྟར་མི་བལྟ་སྟེ།
en: In case you may think that at that time King Virtuous Vision was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་དགེ་བའི་མིག་ཅེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was King Virtuous Vision.

source: དེ་ལྟ་བས་ན་དེ་ཕྱིན་ཅད་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལ་ངོམས་པ་མེད་པར་བྱེད་དེ།
en: Because of this, from that point onward, I was indefatigable in bringing sentient beings to maturity.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན་
en: How is this?

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་ཇི་ཙམ་དུ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་དེ་ཙམ་གྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་སྟེ།
en: When I was training as a bodhisattva, the more I brought beings to maturity, the more they passed beyond suffering.

source: མཽད་གལ་གྱི་བུ་སེམས་ཅན་དེ་དག་གི་གྲངས་ཡོངས་སུ་ཤེས་པར་ནུས་པ་གང་ཡང་མེད་དེ། ངས་སེམས་ཅན་དེ་སྙེད་ཡོངས་སུ་མྱ་ངན་ལས་བཟླས་སོ། །
en: Maudgalyāyana, as inconceivable a number of beings as they were, I was able to lead them all to transcend suffering.

source: སེམས་ཅན་དེ་དག་གི་གྲངས་གདགས་པར་ཡང་མི་ནུས་ཏེ།
en: One could not even count their number.

source: མཽད་གལ་གྱི་བུ་ངས་སངས་རྒྱས་ཀྱི་རྒྱུད་མི་གཅད་པར་བྱ་བའི་ཕྱིར་ཞུགས་ནས་ངས་སེམས་ཅན་དེ་སྙེད་ཅིག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་ཡོངས་སུ་བཙུད་ཅིང་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། །
en: Maudgalyāyana, applying myself to the preservation of the Buddha’s lineage, I led that amount of sentient beings to unexcelled and perfect awakening, and brought them to maturity.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་རྒྱུད་མི་གཅད་པར་བྱ་བ་ལ་རྣལ་འབྱོར་དུ་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas should practice for the sake of preserving the buddha lineage.

source: མཽད་གལ་གྱི་བུ་ངས་ཁམས་སྣ་ཚོགས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། ཁམས་སྣ་ཚོགས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཐོབ་ནས། བདག་གིས་སེམས་ཅན་གྱི་དོན་ཇི་ལྟར་བྱ་སྙམ་ནས།
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva, in order to gain knowledge of the origin as related to knowledge of the various elements, I pondered, ‘If I were to attain knowledge of the origin as related to knowledge of the various elements, how could I then benefit beings?’

source: དགེ་བའི་རྩ་བ་རྣམ་པ་དུ་མ་མངོན་པར་འདུས་བྱས་ཏེ།
en: With that thought in mind, I created manifold roots of virtue.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། མགར་བ་ལེགས་རྟོགས་ཞེས་བྱ་བ་མགར་བ་མཛངས་ཤིང་གསལ་ལ་ཡིད་གཞུངས་པ། བཟོ་རྣམས་ལ་བསླབས་པ་ཞིག་བྱུང་སྟེ།
en: Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a blacksmith named Smart Blacksmith, who was wise, bright, prudent, and skilled in craftsmanship.

source: དེ་ཡོངས་སུ་སྦྱང་བ་བྱས་པས་གསེར་གྱི་གཟུགས་བརྙན་ལ་འཇུག་པ་ཤེས། ལྡང་བ་ཡང་ཤེས། རིན་ཡང་ཤེས་སོ། །
en: In the course of his training, he learned how to work on golden statues, just as he learned extraction and came to understand value.

source: དེ་ཡོངས་སུ་སྦྱང་བ་བྱས་པའི་གསེར་གྱི་གཟུགས་བརྙན་གྱི་རིན་ལ་ཤིན་ཏུ་རྨོངས་པ་མེད་པས་ཕྱོགས་དང་ཕྱོགས་མཚམས་སུ་རྒྱ་ཆེར་ཀྱེ་མ་མགར་བ་འདི་མཁས་སོ་ཞེས་གྲགས་པ་དང་། སྒྲ་དང་ཚིགས་སུ་བཅད་པའི་མངོན་པར་འཕགས་སོ། །
en: As he developed his expertise in these matters, he became highly knowledgeable regarding the value of gold statues, so that it became common in every direction of the land for people to remark, ‘Wow, what a master blacksmith he is!’ and to laud and praise him.

source: འདི་བཟོའི་མཆོག་ཁོང་དུ་ཆུད་པས་རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་གྱི་བར་དུ་གྲགས་ནས་དེའི་རྙེད་པ་དག་ཀྱང་བྱུང་སྟེ།
en: As he came to master supreme craftsmanship, his renown even spread to the royal palace, which provided him with wealth.

source: རྒྱལ་པོ་དེའི་གོས་དག་བྱིན།
en: The king lavished him with clothing,

source: འགྲོ་བ་ཐམས་ཅད་ཀྱིས་ཀྱང་། བཟོ་བོ་དེའི་ཚིག་གཟུང་བར་འོས་པར་གྱུར་ཏོ། །
en: and everyone came to consider the craftsman a man of his word.

source: དེའི་ཚེ་དེའི་དུས་ན་མགར་བ་ལེགས་རྟོགས་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ
en: In case you may think that at that time Smart Blacksmith was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་མགར་བ་ལེགས་རྟོགས་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was Smart Blacksmith.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་ཁམས་སྣ་ཚོགས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ལ་མཁས་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas should become wise in knowledge of the origin as related to knowledge of the various elements.

source: མཽད་གལ་གྱི་བུ་ངས་གཞན་ཡང་ཁམས་སྣ་ཚོགས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། དགེ་བའི་རྩ་བ་རྣམ་པ་དུ་མ་དག་མངོན་པར་འདུས་བྱས་ཏེ།
en: “Moreover, Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, in order to understand the origin as related to knowledge of the various elements, I created manifold roots of virtue.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་གར་གྱི་སློབ་དཔོན་འགྲོ་བ་ཐམས་ཅད་ཀྱི་གཙོ་བོ་ཞེས་བྱ་བ་
en: Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a dance teacher named Chief of All Beings.

source: མཛངས་ཤིང་གསལ་ལ་ཡིད་གཞུངས་པ་མཁས་ཤིང་མཉེན་ལ་འཐུན་པ་དང་། ཚིག་གཟུང་བར་འོས་པ་སྐྱེ་བོའི་ཚོགས་མང་པོས་མནོས་ཤིང་མངོན་པར་དགའ་བ།
en: He was wise, bright, prudent, skilled, gentle, harmonious, trustworthy, and cared for and liked by many.

source: དུས་ཤེས་པ་དང་། དུས་མ་ཡིན་པ་ཤེས་པ་དང་། མ་ཤེས་པ་དང་། ཕ་ཤེས་པ་དང་། བདག་ཤེས་པ་དང་། འཁོར་ཤེས་པ་དང་། འཇིག་རྟེན་གྱི་བསམ་པའི་རྗེས་སུ་ཞུགས་ཤིང་ཚིག་སྨྲས་པ་ཙམ་གྱིས་སེམས་ཅན་དག་གི་བསམ་པ་འཛིན་པར་བྱེད་པ་ཞིག་བྱུང་ངོ་། །
en: He understood what is timely and what is untimely, he understood his mother and father, he understood himself and his retinue, he conformed to worldly ways of thinking, and he could captivate people’s minds just by speaking.

source: དེའི་བུ་མོ་འགྲོ་བའི་དཔའ་མོ་ཞེས་བྱ་བ་དེ་བཞིན་གཤེགས་པ་དཔག་ཏུ་མེད་པ་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ།
en: He had a daughter named Heroine of Beings who had formed roots of virtue before countless thus-gone ones.

source: བསམ་པ་རྒྱ་ཆེ་བ་འདོད་ཆགས་ཆུང་། ཞེ་སྡང་ཆུང་། གཏི་མུག་ཆུང་བ།
en: She was broad-minded, and had little desire, anger, or stupidity.

source: མིའི་མདོག་ལས་འདས་ཤིང་། ལྷའི་གཟུགས་ཀྱི་མདོག་ལྟ་བུ་ཡང་དག་པར་ཐོབ་པ།
en: Her complexion was superhuman; she had a complexion like a divine being.

source: བྲོ་གར་གྱི་བཟོ་ལ་མཆོག་ཏུ་མཁས་པ། ཆོ་ག་ལ་མཁས་པ།
en: She had utter prowess in the art of dance and was proficient in ceremony as well.

source: མཐོང་བ་ཙམ་གྱིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མིག་འཛིན་པ་ཞིག་བྱུང་ངོ་། །
en: Everyone was captivated just by seeing her.

source: དེའི་ཚེ་དེར་སྐྱེ་བོའི་ཚོགས་མང་པོ་འདུས་ཤིང་ཚོགས་མང་པོ་འཁོད་དོ། །
en: In that place, one time many people gathered, and an assembly was formed.

source: དེ་ནས་གར་མཁན་གྱི་བུ་མོ་འགྲོ་བའི་དཔའ་མོ་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་ནས་ཚོགས་ཀྱི་དབུས་སུ་འདུག་སྟེ། གླུ་དབྱངས་འདི་དག་བླངས་སོ། །
en: Heroine of Beings, the dance instructor’s daughter, decorated herself in jewelry, stood at the center of the group, and then sang this song:

source: ལང་ཚོ་འདི་དག་རི་བོའི་ཆུ་ལྟར་འགྲོ། །སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་ཤིན་ཏུ་ལྟུང་། །
en: “ ‘Youth passes by like a mountain stream— Just a moment, an instant, a flash and it’s gone.

source: བྱིས་པའི་སྐྱེ་བོ་རབ་ཏུ་མྱོས་པ་དག །བརྒྱལ་ཞིང་གཡོ་བའི་ཤུགས་ཀྱང་མི་ཤེས་སོ། །
en: And yet the childish, intoxicated as they are, Have fainted and do not have the strength to move.

source: སྟོན་ཀའི་སྤྲིན་སྟུག་སྙིང་པོ་མེད་པ་དང་། །འཕྱར་བའི་ཤུགས་ལྟར་ལང་ཚོ་འགྲོ་བ་ཡིན། །
en: “ ‘Youth passes by as fast as the force of a flood, Or dense yet insubstantial autumn clouds.

source: གང་དག་གཟུགས་ཀྱི་བཅིང་བས་བཅིངས་པ་ནི། །མི་རྟག་མི་ལྟུང་བར་ནི་མི་འཛིན་ཏོ། །
en: Those bound by the fetter of a body do not last, And can’t keep a permanent state that doesn’t decline.

source: ཇི་ལྟར་བུས་པ་ཁྱེའུའི་མ་མ་ལྟར། །མི་མཁས་བློ་གྲོས་ངན་པ་དེ་དག་ནི། །ཡིད་སླུ་འཆི་བར་འགྲོ་བ་མི་ཤེས་སོ། །
en: “ ‘Just like an infant’s nanny, Foolish, senseless people delude themselves, And don’t notice they’re headed toward their death.

source: དེ་དག་འབྲས་བུ་མེད་པས་ཡིད་སྦགས་པ། །དེ་ནི་མི་རྟག་འཇིག་པས་སྐེམས་པར་བྱེད། །
en: Their minds defiled by useless things, “ ‘They are mortified by the terror of impermanence.

source: བསོད་ནམས་མེད་པ་འཆི་མཐས་སྲོག་འཇོམས་སོ། །
en: Without any merit, death steals their lives.

source: མཁས་པ་གང་དག་རྒྱལ་བའི་གསུང་རབ་ལ། །རྟག་ཏུ་བརྩོན་པ་ལང་ཚོ་དགའ་འབྲེལ་ལ། །མཁས་པ་དེ་ཡིས་དགའ་བར་མི་བྱའོ། །
en: The wise who always apply themselves To the Victor’s teachings should not take pleasure “ ‘In the amusing relations of youth.

source: མཁས་པས་བདེ་བར་གཤེགས་པའི་གསུང་རབ་ལ། །ལང་ཚོ་མི་རྟག་སྙིང་མེད་བརྟག་པར་གྱིས། །དགའ་བདེ་ཡིས་ལང་ཚོ་སྔོན་དུ་འཕྲོག །
en: The wise should examine in the Blissful One’s words How fleeting and pointless youth is. Diversion robs away your youth.

source: གལ་ཏེ་སྐྱེ་བོ་མཁས་པ་མཛངས་པ་དག །འདི་དག་བདག་མེད་ལང་ཚོརྟོག་པར་བྱེད། །
en: “ ‘If someone is wise and sagacious He’ll contemplate how youth lacks identity.

source: ཇི་ལྟར་སྐྱེས་བུ་རང་གི་རྫས་ཚོལ་བ། །དེ་བཞིན་དགའ་བས་རང་གི་རྫས་ཚོལ་ལོ། །
en: Like people searching for their own possessions, So too does pleasure seek its own possessions.

source: གང་གིས་སྣོད་བརྙས་ཇི་སྲིད་བདག་ལ་འདུག །དེ་བཞིན་ལང་ཚོ་བདག་གི་དོན་བྱེད་དེ། །
en: “ ‘Like having a vessel that someone loaned you, In the same way youth can serve your purpose;

source: བདག་ནི་གང་གིས་བརྙས་པའི་སྣོད་འདྲའོ། །ཇི་སྲིད་ལང་ཚོ་ལ་ནི་བདག་གནས་པ། །
en: It is like a borrowed vessel. As long as you remain in youth,

source: སྟོབས་དང་བརྩོན་འགྲུས་བདག་གིས་ཉམས་མི་བྱ། །
en: “ ‘Don’t let your strength and diligence go to waste.

source: བདག་གི་ལང་ཚོ་རྒ་བས་སྔོན་འཕྲོག་པས། །རྒྱལ་བའི་བསྟན་ལ་བདག་གིས་སྦྱར་བར་བྱ། །
en: Since your youth will be stolen away by old age, You should apply yourself to the Victor’s teachings!

source: ལང་ཚོའི་རྣམ་པ་གང་དག་ཕྲོགས་པ་ནི། །ཀྱེ་མ་བསམ་པ་བསླུས་ཤིང་སྟོབས་ཉམས་སོ། །
en: Those whose youth has been robbed away— “ ‘Oh, how their minds are confused and their strength declines!

source: ལང་ཚོའི་རྣམ་པ་དེ་ཡི་སྐད་ཅིག་ལ། །མི་རྟག་སྟོབས་ཉམས་མི་སླ་མ་ཡིན་ནོ། །
en: At this moment when you’re young, it’s not difficult To contemplate impermanence and becoming weaker.

source: ལང་ཚོ་མི་རྟག་དེ་ཡི་སྐད་ཅིག་ལ། །ཡོངས་སུ་བརྟག་པར་བྱ་བ་མི་སླ་སྟེ། །
en: But at the moment when youth fades away, “ ‘It will no longer be easy to do so!

source: དེ་བས་མི་ནི་ལང་ཚོ་འཛིན་པའི་ཚེ། །རྒ་བ་ཟད་པར་བྱ་ལ་འབད་པར་གྱིས། །
en: Therefore when people still have their youth They should apply themselves to ending old age.

source: ལང་ཚོ་རྒ་བས་ཡལ་ཅིང་རྒས་པ་དང་། །ཉམས་པས་ཆོས་ནི་གཏད་པར་མི་ནུས་སོ། །
en: Youth is depleted by aging. “ ‘Once old and weak, one can’t focus on the Dharma.

source: མཁས་པ་གང་དག་རྒྱལ་བའི་བསྟན་པ་ལ། །སྤྱོད་པར་བྱེད་པ་བདུད་རྩི་ཚོལ་བ་ཡིན། །
en: The wise who apply the Victor’s teachings Are in pursuit of the nectar of immortality.

source: མེ་ལ་ཆུ་ཡིས་བཏབ་ན་མི་འབར་ལྟར། །བདུད་ཀྱི་ཞགས་པ་དེ་ཡིས་གཅོད་པར་བྱེད། །
en: Like a fire that goes out when doused with water, “ ‘They cut the fetters of Māra.

source: དེ་ལྟ་བས་ན་ལང་ཚོ་འཛིན་པ་ན། །བདེ་བར་གཤེགས་ཀྱི་བསྟན་ལ་སྤྱད་པར་གྱིས། །
en: Therefore when you are still young Apply yourself to the Blissful One’s teachings;

source: ལང་ཚོ་སྤྱོད་པ་བདུད་ཀྱི་འཁོར་ལས་རྒྱལ། །
en: Use your youth and conquer the minions of Māra.’

source: དེའི་ཚེ་དེའི་དུས་ན་བུ་མོ་འགྲོ་བའི་དཔའ་མོ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ
en: In case you may think that at that time the maiden called Heroine of Beings was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་གར་མཁན་གྱི་བུ་མོ་འགྲོ་བའི་དཔའ་མོ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the dance instructor’s daughter named Heroine of Beings.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན། རྒ་བའི་ཁམས་དང་སྐྱེ་མཆེད་ཐལ་བར་མ་བརླག་པ་དེ་སྲིད་དུ་མཁས་པས་བདུད་རྩི་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་འབད་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, until the element and sense source of aging have been reduced to dust, wise people should put effort into realizing the nectar of immortality.

source: མཽད་གལ་གྱི་བུ་ངས་གཞན་ཡང་ཁམས་སྣ་ཚོགས་ཤེས་པ་འགོག་པ་ཤེས་པར་བྱ་བའི་དོན་དུ་བདག་གིས་ཆོས་གང་དག་ཡོངས་སུ་ཤེས་པ་ཇི་ལྟར་མི་འགག་པར་བྱ་སྙམ་ནས
en: “Furthermore, Maudgalyāyana, in order to understand cessation as related to knowledge of the various elements, I wondered to myself, ‘Which dharmas make it so that knowledge is uninterrupted?’ and

source: དགེ་བའི་རྩ་བ་དཔག་ཏུ་མེད་པ་མངོན་པར་འདུས་བྱས་ཏེ།
en: with that in mind I created countless roots of virtue.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། དེ་བཞིན་གཤེགས་པ་གྲགས་པ་མ་སྨད་པ་ཞེས་བྱ་བ་ཞིག་བྱུང་ངོ་། །
en: Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a thus-gone one named Irreproachable Renown.

source: དེའི་གསུང་རབ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སྤྱོད་པ་བླ་མ་ཞེས་བྱ་བ་ཞིག་བྱུང་སྟེ། ཡིད་དམ་བླངས་པ་ལས་མི་གཡོ་བ་དང་ལྡན་པ་ཞིག་བྱུང་ངོ་། །
en: One student of his teachings, a bodhisattva named Highest Practice, took a set of commitments that he then kept unwaveringly.

source: དེའི་ཡི་དམ་གྱི་ཚུལ་ནི་འདི་དག་ཡིན་ཏེ།
en: His commitments were as follows:

source: ཇི་སྲིད་དུ་བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སེམས་ཅན་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་སྣོད་དུ་མ་གྱུར་ན། དེ་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱའོ། །
en: ‘Until everyone in my buddha realm has become a vessel for unexcelled and perfect awakening, I will not fully awaken to unexcelled and perfect buddhahood.

source: ཇི་སྲིད་དུ་བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་གང་སེམས་ཅན་སྐྱེས་པ་དེ་དག་ཐམས་ཅད་མངོན་པར་ཤེས་པ་མྱུར་བ་བདེ་བའི་ལམ་གྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་མ་གྱུར་ན། དེ་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱའོ། །
en: Until it is possible for everyone born in my buddha realm to attain nirvāṇa through the easy path of the swift superknowledges, I will not fully awaken to unexcelled and perfect buddhahood.

source: ཇི་སྲིད་དུ་བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སེམས་ཅན་སྐྱེས་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་མི་དགེ་བའི་ཆོས་སྤངས་ཤིང་དགེ་བའི་ཆོས་ཐམས་ཅད་དང་ལྡན་པར་མ་གྱུར་ནདེ་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱའོ། །
en: Until every being born in my buddha realm has abandoned unwholesome phenomena and adopted wholesome phenomena, I will not fully awaken to unexcelled and perfect buddhahood.

source: ཇི་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་སེམས་ཅན་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་མ་གྱུར་ནདེ་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱའོ། །
en: Until all beings who are to fully awaken to unexcelled and perfect buddhahood have become irreversible from unexcelled and perfect buddhahood, I will not fully awaken to unexcelled and perfect buddhahood.

source: གལ་ཏེ་བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སེམས་ཅན་དམྱལ་བའི་སྒྲའམ། དུད་འགྲོའི་སྐྱེ་གནས་འཐོབ་པའམ། གཤིན་རྗེའི་འཇིག་རྟེན་དུ་སྐྱེ་བའམ། ལྷ་མ་ཡིན་གྱི་རིས་སུ་སྐྱེ་བར་གྱུར་ན་དེ་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱའོ། །
en: As long as anyone might hear the word “hell” in my buddha realm, or be reborn as an animal, or take birth in the realm of the Lord of Death, or be reborn in the class of demigods, I will not fully awaken to unexcelled and perfect buddhahood.

source: གལ་ཏེ་བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སྡུག་བསྔལ་གྱི་སྒྲ་ཡོད་ན་དེ་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱའོ། །
en: As long as the word “suffering” can be heard in my buddha realm, I will not fully awaken to unexcelled and perfect buddhahood.

source: གལ་ཏེ་བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སེམས་ཅན་སྐྱེས་པ་དེ་དག་ཐམས་ཅད་སྲིད་པ་ཐམ་པར་མ་གྱུར་ན་དེ་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་སྟེ
en: Until all beings who take birth in my buddha realm are in their final rebirth, I will not fully awaken to unexcelled and perfect buddhahood.

source: བྱང་ཆུབ་སེམས་དཔའ་སྨོན་ལམ་གྱིས་གནས་པ་ནི་མ་གཏོགས་སོ། །
en: I will exclusively remain due to my prayers as a bodhisattva.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་འདི་ལ་སོགས་པའི་ཡོན་ཏན་གཞན་དང་ཡང་ལྡན་ནོ།
en: These, among others, will be the qualities of my buddha realm.’

source: མཽད་གལ་གྱི་བུ་ཁྱོད་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་སྤྱོད་པ་བླ་མ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ
en: “Maudgalyāyana, in case you may think that at that time the bodhisattva named Highest Practice was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་སྤྱོད་པ་བླ་མ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was Highest Practice.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སེམས་ཅན་རྣམས་ལ་ཕན་པར་བྱ་བའི་དོན་དུ་ཡིད་དམ་ལ་བརྟན་པར་བྱའོ།། །།
en: Therefore, Maudgalyāyana, bodhisattva great beings should keep a firm commitment to help sentient beings.

source: མངོན་པར་འདུས་བྱས་ཏེ་མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་རྒྱལ་པོ་ཟླ་སྦྱིན་གྱི་བུ་མོ།
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a king named Candradatta who had a daughter named Innumerable.

source: བུ་མོ་གྲངས་ལས་འདས་པ་ཞེས་བྱ་བ་གཟུགས་བཟང་ཞིང་མཛེས་པ།
en: Princess Innumerable was gorgeous and had a lovely figure.

source: བལྟ་ན་སྡུག་པ་ཁ་དོག་བཟང་མོ་རྒྱས་པ་མཆོག་དང་ལྡན་པ་ཞིག་བྱུང་ངོ་། །
en: She was attractive and had a fine complexion. She was fully developed and sublime.

source: དེ་ཕ་མས་ཁྱིམ་ཐབ་ལ་བཏང་བར་བྱས་སོ། །དེས་ཕ་མ་དེ་དག་ལ་སྨྲས་པ།
en: When her parents were giving her up for marriage, she begged them:

source: ཡབ་ཡུམ་བདག་ནི་ཁྱིམ་ཐབ་མི་འཚལ་ལོ། །
en: ‘Father, Mother—please don’t give me up for marriage!’

source: དེའི་ཕ་མས་སྨྲས་པ་བུ་མོ་ཁྱོད་ཀྱི་བསམ་པ་ཅི་ཡོད།
en: “Her parents replied, ‘Child, what is your wish?’

source: དེས་སྨྲས་པ། ཡབ་ཡུམ་བདག་ནི་ཁྱིམ་ཐབ་མི་འཚལ་ཏོ། །
en: “She answered, ‘Father, Mother—please do not give me up for marriage!

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན་ཡབ་ཇི་ཙམ་དུ་ཉེ་བར་ལེན་པ་དེ་ཙམ་དུ་སྡུག་བསྔལ་བ་ལགས་སོ། །
en: If you ask why I say this, Father, it is because the more one acquires, the more one suffers.

source: གང་ལ་ཉེ་བར་ལེན་པ་མ་མཆིས་པ་དེ་ལ་སྡུག་བསྔལ་མ་མཆིས་སོ། །
en: Those who have no possessions have no suffering.

source: ཡབ་གཟིགས་ཤིག་ཁྱིམ་ཐབ་མཆིས་པ་ལ་ནི་ཁྱིམ་ཐབ་ཀྱི་མྱ་ངན་མཆིས་ལ།
en: Just look, Father, at how much grief comes with being a householder.

source: ཁྱིམ་ཐབ་མ་མཆིས་པ་ལ་ནི་ཁྱིམ་ཐབ་ཀྱི་མྱ་ངན་མ་མཆིས་སོ། །
en: With no household the grief of being a householder would be gone.

source: བུ་མཆིས་པ་ལ་ནི་བུའི་མྱ་ངན་མཆིས་ལ། བུ་མ་མཆིས་པ་ལ་ནི་བུའི་མྱ་ངན་མ་མཆིས་སོ། །
en: With having children come the troubles of having children. Without children the troubles of having children would be gone.

source: འཛིན་པ་མཆིས་པ་ལ་ནི་འཛིན་པའི་མྱ་ངན་མཆིས་ལ། འཛིན་པ་མ་མཆིས་པ་ལ་ནི་འཛིན་པའི་མྱ་ངན་མ་མཆིས་ཏེ།
en: With attachments come the troubles of attachments; without attachments the troubles of attachments would be gone.

source: བདག་འཛིན་པ་དེས་འཚལ་ཏོ། །འཛིན་པ་མཆིས་ན་ནོངས་པ་ཐམས་ཅད་འབྱུང་སྟེ།
en: This is how I understand attachments: they are the source of all problems.

source: བདག་ཁྱིམ་ཐབ་དེས་འཚལ་ཏོ། །
en: This is how I understand the householder life:

source: གནོད་པས་འཚལ་ཏོ། །
en: I understand it as something harmful.

source: ཡབ་སེམས་ཅན་དག་ཁམས་སྣ་ཚོགས་ལ་མོས་ཏེ།
en: Father, sentient beings have interest in various elements.

source: གང་འཁོར་བ་ལ་དགའ་བ་དེ་དག་ལ་ནི་འཛིན་པ་འཚལ་གྱི།
en: Those who take pleasure in cyclic existence seek out attachments.

source: གང་འཁོར་བ་ལ་མི་དགའ་བ་དེ་དག་ལ་ནི་འཛིན་པ་མི་འཚལ་ཏེ།
en: Those who take no pleasure in cyclic existence do not seek out attachments.

source: བདག་ཀྱང་འཁོར་བ་ལ་གློ་བ་མི་དགའ་སྟེ།
en: I take no pleasure in cyclic existence;

source: དེས་ན་བདག་འཛིན་པ་མི་འཚལ་ལོ། །
en: thus I do not seek out attachments.

source: གང་གིས་འཛིན་པ་ཐམས་ཅད་སྤངས་ན་དེ་བདེ་བ་ཞེས་བགྱིའོ། །
en: Happiness occurs when one gives up all attachments.’

source: དེའི་ཚེ་དེའི་དུས་ན་བུ་མོ་གྲངས་ལས་འདས་པ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ
en: In case you may think that at that time Princess Innumerable was anyone else, Maudgalyāyana, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་བུ་མོ་གྲངས་ལས་འདས་པ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was Princess Innumerable.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་ངའི་སྔོན་གྱི་ལྟར། ད་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔས་འཛིན་པ་ཡོད་ན་སྡུག་བསྔལ་དུ་འགྱུར་ཞིང་། འཛིན་པ་མེད་ན་སྡུག་བསྔལ་དུ་མི་འགྱུར་རོ། །
en: Therefore, Maudgalyāyana, just as with me in the past, so with bodhisattvas in the present—if they have attachments, they will suffer, while they will not suffer if they have no attachments.

source: ཞེས་རིག་པར་བྱས་ནས་འཛིན་པ་མེད་པ་ལ་བསླབ་པར་བྱའོ། །
en: They should understand this principle and train in having no attachments.

source: མཽད་གལ་གྱི་བུ་ངས་ཁམས་སྣ་ཚོགས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། བདག་ཁམས་སྣ་ཚོགས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་མངོན་པར་རྫོགས་པར་ཤེས་ནས།
en: Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, in order to understand the path that leads to cessation as related to knowledge of the various elements, I came to understand perfectly the knowledge of the origin as related to the various elements.

source: སེམས་ཅན་རྣམས་ལ་ཇི་ལྟར་རབ་ཏུ་བསྟན་པར་བྱ་སྙམ་ནས། དགེ་བའི་རྩ་བ་རྣམ་པ་སྣ་ཚོགས་དུ་མ་དག་མངོན་པར་འདུས་བྱས་ཏེ།
en: Then, wondering how I could explain it to beings, I created a multitude of different roots of virtue.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་མཚོན་མགར་རྒྱལ་སྡེ་ཞེས་བྱ་བ་ལས་ཞིབ་མོ་ཐམས་ཅད་ལ་ཤིན་ཏུ་བསླབས་པ།
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there appeared in the world a man named Jayasena the Swordsmith, who had mastered all the fine points of his trade.

source: རྒྱའི་ལས་ཐམས་ཅད་ལ་ཤིན་ཏུ་བསླབས་པ། སྣོད་ཀྱི་རྒྱ་ཐམས་ཅད་འདྲི་བ་ཞིག་བྱུང་ངོ་། །
en: He had mastered every trade with a seal and was well familiar with all of the seals of vessels.

source: དེ་ནས་མཚོན་མགར་རྒྱལ་སྡེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: One day Jayasena the Swordsmith had the thought,

source: བདག་གིས་བཟོ་ཐམས་ཅད་ཀྱི་སོ་སོའི་རྒྱ་བཟུང་སྟེ།
en: ‘I hold the seal of every single trade.

source: གང་བདག་གིས་བཟོ་སོ་སོའི་རྒྱ་མ་བཟུང་བ་ཅུང་ཟད་ཀྱང་མེད་དོ་སྙམ་མོ། །
en: There is not even a single trade seal I do not possess.’

source: དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་མཐའ་ཡས་གཟིགས་ཞེས་བྱ་བ་
en: “At that time there appeared in the world a thus-gone one named Infinite Vision;
